app/controllers/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.create(auth_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "x@f.com"], ["LIMIT", 1]]
---
  def login
    user_info = auth_params
    @command = AuthenticateUser.call(user_info[:email], user_info[:password])
    @user = User.find_by(email: user_info[:email])