app/controllers/chat_controller.rb

  def index
    user_friendships = @current_user.friendships
                                    .joins(:messages)
                                    .group('friendships.id')
    inverse_friendships = Friendship.joins(:messages)
                                    .where("friend_id = #{@current_user.id}")
                                    .group('friendships.id')
    @friendships = Array.new

    user_friendships.each do |fs|
      @friendships.push(fs)
    end

    inverse_friendships.each do |inv_fs|
      friendship = Friendship.where("user_id = #{inv_fs.friend_id} AND friend_id = #{inv_fs.user_id}").first
---
SELECT "friendships".* FROM "friendships" INNER JOIN "messages" ON "messages"."friendship_id" = "friendships"."id" WHERE "friendships"."user_id" = $1 AND (friendships.friend_id = 2) GROUP BY friendships.id  [["user_id", 2]]
SELECT  "friendships".* FROM "friendships" WHERE (user_id = 2 AND friend_id = 3) ORDER BY "friendships"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "friendships".* FROM "friendships" INNER JOIN "messages" ON "messages"."friendship_id" = "friendships"."id" WHERE "friendships"."user_id" = $1 GROUP BY friendships.id LIMIT $2  [["user_id", 2], ["LIMIT", 11]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]