app/controllers/friend_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]
---
  def show
    @friendship = @current_user.friendships.find_by(friend_id: params[:friend_id])

SELECT users.*, friendships.* FROM "users" INNER JOIN "friendships" "friendships_users" ON "friendships_users"."user_id" = "users"."id" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1 AND (name LIKE '%Xim%')  [["user_id", 1]]
---
  def search
    @friendships = @current_user.friends.joins(:friendships)
                            .where("name LIKE '%#{params[:friend_name]}%'")
                            .select("users.*, friendships.*")

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 4], ["created_at", "2018-04-09 17:36:07.742567"], ["updated_at", "2018-04-09 17:36:07.742567"]]
---
  def create
    friend_info = friend_params
    friendship = @current_user.friendships.create(friend_info)

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 ORDER BY "friendships"."id" ASC LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]
---
  def destroy
    friendship1 = @current_user.friendships.find_by(friend_id: params[:friend_id])
    friend = friendship1.friend
    friendship2 = friend.friendships.find_by(friend_id: @current_user.id)

    friendship1.destroy