app/controllers/item_controller.rb

  def buy
    @item = Item.find(params[:item_id])
    info = params.permit(:item_id, :quantity)
    total_price = @item.price * Integer(info[:quantity])

    return json_response(success: false) unless @current_user.money >= total_price
    inventory = @current_user.inventories.find_by(item_id: info[:item_id])

    if(!inventory)
      @current_user.inventories.create!(info)
    else
      info[:quantity] = Integer(info[:quantity]) + inventory.quantity
      inventory.update!(quantity: info[:quantity])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."item_id" = $2 LIMIT $3  [["user_id", 1], ["item_id", 3], ["LIMIT", 1]]
INSERT INTO "inventories" ("quantity", "user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["user_id", 1], ["item_id", 3], ["created_at", "2018-04-11 16:35:53.860387"], ["updated_at", "2018-04-11 16:35:53.860387"]]
UPDATE "inventories" SET "quantity" = $1, "updated_at" = $2 WHERE "inventories"."id" = $3  [["quantity", 4], ["updated_at", "2018-04-11 17:30:01.581773"], ["id", 3]]
UPDATE "users" SET "money" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["money", 0], ["updated_at", "2018-04-11 16:35:53.890939"], ["id", 1]]

  def create
    info = item_params
    @item = Item.create!(info)
---
INSERT INTO "items" ("name", "price", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Item1"], ["price", 100], ["picture", "abc"], ["created_at", "2018-04-11 16:04:22.600086"], ["updated_at", "2018-04-11 16:04:22.600086"]]

  def update
    @item = Item.find(params[:id])
    info = item_params
    @item.update!(info)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["name", "Item especial"], ["updated_at", "2018-04-17 01:51:49.318188"], ["id", 1]]