app/controllers/item_web_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."id" ASC
---
  def index
    @items = Item.all.order(:id)

INSERT INTO "items" ("name", "price", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "items".* FROM "items"
---
  def create
    info = item_params
    cloudinary_base_url = 'http://res.cloudinary.com/epikhdez/'
    info[:picture] = cloudinary_base_url + info[:picture]

    Item.create!(info)

    @items = Item.all