app/controllers/match_controller.rb

SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 211], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."game_number" = $2 LIMIT $3  [["user_id", 3], ["game_number", 1], ["LIMIT", 1]]
---
  def show
    @match = @current_user.matches.find(params[:match_id])
    inverse_match = @match.rival.matches.find_by(game_number: @match.game_number)

SELECT COUNT(*) AS count_all, "matches"."game_number" AS matches_game_number FROM "matches" GROUP BY "matches"."game_number"
SELECT  1 AS one FROM "matches" WHERE (user_id = 2 and rival_id = 1 and game_id = 17) LIMIT $1  [["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE (user_id = 2, rival_id = 1, game_id = 16)
INSERT INTO "games" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-04-10 02:12:39.938016"], ["updated_at", "2018-04-10 02:12:39.938016"]]
INSERT INTO "matches" ("turn", "user_id", "rival_id", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["turn", "f"], ["user_id", 2], ["rival_id", 1], ["game_id", 1], ["created_at", "2018-04-10 02:12:39.988625"], ["updated_at", "2018-04-10 02:12:39.988625"]]
---
  def create
    rival = create_params
    err_msg = 'User and rival cannot be the same person.'
    rival_id = Integer(rival[:rival_id])

    return json_response({error: err_msg}, :unprocessable_entity) unless @current_user.id != rival_id
    matches = Match.all.group(:game_number).count

    if matches.empty?
      game_number = 1
    else
      game_number = matches.count + 1
    end
    puts game_number

    info = {rival_id: rival[:rival_id], game_number: game_number}
    @match = @current_user.matches.create!(info)

SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."game_number" = $2 LIMIT $3  [["user_id", 3], ["game_number", 1], ["LIMIT", 1]]
UPDATE "matches" SET "board_set" = $1, "board" = $2, "updated_at" = $3 WHERE "matches"."id" = $4  [["board_set", "t"], ["board", "\"{}\""], ["updated_at", "2018-04-14 06:17:51.197688"], ["id", 1]]
---
  def setup
    match = @current_user.matches.find(params[:match_id])
    return json_response({error: 'Board already set.'}, :unprocessable_entity) if match.board_set?

    info = setup_params
    inverse_info = {turn: true}
    inverse_match = match.rival.matches.find_by(game_number: match.game_number)

    match.update!(info)

SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 232], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."user_id" = $1 AND "matches"."game_number" = $2 LIMIT $3  [["user_id", 3], ["game_number", 1], ["LIMIT", 1]]
UPDATE "games" SET "board" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["board", "\"{\\\"a\\\":\\\"b\\\"}\""], ["updated_at", "2018-04-10 17:04:34.860837"], ["id", 21]]
UPDATE "matches" SET "score" = $1, "destroyed_ships" = $2, "victory" = $3, "finished" = $4, "updated_at" = $5 WHERE "matches"."id" = $6  [["score", 100], ["destroyed_ships", 5], ["victory", "t"], ["finished", "t"], ["updated_at", "2018-04-16 04:42:15.688699"], ["id", 1]]
---
  def update
    match_info = update_params

    if match_info.key?(:finished)
      if match_info.key?(:victory)
        inverse_victory = !match_info[:victory]
        inverse_info = {lost_ships: match_info[:destroyed_ships], board: match_info[:board], turn: false, victory: inverse_victory, finished: true}
      else
        return json_response({error: 'Missing victory param.'}, :unprocessable_entity)
      end
    else
      inverse_info = {lost_ships: match_info[:destroyed_ships], turn: true, board: match_info[:board]}
    end

    match_info.delete(:board)

    @match = @current_user.matches.find(params[:match_id])
    inverse_match = @match.rival.matches.find_by(game_number: @match.game_number)

    json_response({error: 'Cannot update a finished game.'}, :unprocessable_entity) if @match.finished

    @match.update!(match_info)