app/controllers/message_controller.rb

  def show
    friendship1 = @current_user.friendships.find(params[:friendship_id])
    friendship2 = Friendship.find_by(user_id: friendship1.friend_id, friend_id: friendship1.user_id)

    @messages = Message.all.joins(:friendship)
                           .where("messages.friendship_id = #{friendship1.id} OR \
                                   messages.friendship_id =  #{friendship2.id}")
                           .order("messages.created_at")
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" INNER JOIN "friendships" ON "friendships"."id" = "messages"."friendship_id" WHERE (messages.friendship_id = 1 OR                                    messages.friendship_id =  2) ORDER BY messages.created_at

  def create
    info = message_params
    @friendship = @current_user.friendships.find(info[:friendship_id])
    @message = @friendship.messages.create!(info)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("text", "friendship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Hallo"], ["friendship_id", 1], ["created_at", "2018-04-11 19:05:24.336824"], ["updated_at", "2018-04-11 19:05:24.336824"]]