app/controllers/users_controller.rb

  def random
    @user = nil
    users_quantity = User.all.count

    while @user.nil?
      id = rand(1..users_quantity)
      @user = User.find(id)
---
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]