app/controllers/user_item_controller.rb

  def use_item
    inventory = @current_user.inventories.find_by(item_id: params[:id])
    inventory.quantity -= 1

    if inventory.quantity == 0
      inventory.destroy
    else
      inventory.save
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."item_id" = $2 LIMIT $3  [["user_id", 1], ["item_id", 3], ["LIMIT", 1]]
UPDATE "inventories" SET "quantity" = $1, "updated_at" = $2 WHERE "inventories"."id" = $3  [["quantity", 3], ["updated_at", "2018-04-11 17:36:00.402962"], ["id", 3]]