app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def login
    uparams = user_params
    user = User.find_by(email: uparams[:email])